content/post/20230802235603-bash.md
+++
title = "bash"
author = ["The primary user account"]
lastmod = 2024-10-19T23:16:58+02:00
draft = false
+++

## error handling {#error-handling}

If using `trap func ERR` we need to `set -eE` and not just `set -e`. With the latter, `trap` will not catch errors in functions, because the `ERR trap` is not inherited from parent scope. See this [SO](https://stackoverflow.com/a/35800451). Thus

```text
set -E # export trap to functions
```

Example

```sh
set -eE

print_error() {
    read line file <<<$(caller)
    echo "An error occurred in line $line of file $file:" >&2
    sed "${line}q;d" "$file" >&2
}
trap print_error ERR

function func(){
  echo "hello" | grep soo
}
func
```

See this [SO](https://stackoverflow.com/a/26261518) for special `trap` names: `ERR`, `DEBUG`, `EXIT`, `RETURN` or `help trap`.


## getting help {#getting-help}

Get help to `builtin` bash functions

ex for `caller`

```sh
type caller
help caller
```


## man pages {#man-pages}

The `man man` list the sections and numbers of a manual

> MANUAL SECTIONS
>     The standard sections of the manual include:
>
> 1      User Commands
> 2      System Calls
> 3      C Library Functions
> 4      Devices and Special Files
> 5      File Formats and Conventions
> 6      Games et. al.
> 7      Miscellanea
> 8      System Administration tools and Daemons
>
> Distributions customize the manual section to their specifics,
> which often include additional sections.

List available sections with `man -k` (similar to apropos command)

```sh
man -k "^signal"
bsd_signal (3)       - signal handling with BSD semantics
signal (2)           - ANSI C signal handling
signal (7)           - overview of signals
signal-safety (7)    - async-signal-safe functions
signalfd (2)         - create a file descriptor for accepting signals
signalfd4 (2)        - create a file descriptor for accepting signals
sysv_signal (3)      - signal handling with System V semantics
```

thus to get an overview of signals,

```sh
man 7 signal
```
